let digit = 25;
let fract = 25.03;
let exp = 2e10; // 20000000000
let expSmall = 2e-3; //0.002
let expFract = 1.25e3; //1250
let expFractSmall = 1.25-3; //0.00125
let fract1 = 25.;
let fract2 = .25;


let dec = 9;
let bin = 0b1001; //запись числа 9 в двоичной системе счисления


let oct = 0o7; //запись числа 7 в восьмеричной системе счисления
let oct = 0o10; //запись числа 8 в восьмеричной системе, т.к. числа 8 в восьмеричной системе нет


let x = 0x1b; // запись числа 27 в десятичной системе счисления
