let x = 10 + 5; // 15 - сложение
let y = 10 - 5; // 5 - вычитание
let z = 10 * 5; // 50 - умножение
let q = 10 / 5; // 2 - деление
let w = 10 % 3; // 1 - получение остатка


let complex = 10 + 5 * 10 - 8 / 2; // 56 (5*10;8/2;10+50;60-4)
let complex2 = (10 + 5) * (10 - 8) / 2; //15 (10+5*10-8/2)

//декременты и инкременты. Часто используются в циклах//

let a = 10;
a++; // 11 //инремент прибавляющий - переменная увеличивается на единицу
a--; // 10 //декремент вычитающий - переменная уменьшается на единицу
++a; // 11 //префиксная запись
--a; // 10 // префиксная запись


//присвоение с операцией

x += 5; //x = x + 5;
x -= 5;
x *= 3;
x /= 4;
x %= 5;
